una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam7se512.h
#define AT91C_SSC_RPR   ((AT91_REG *) 	0xFFFD4100) /* (PDC_SSC) Receive Pointer Register*/
#define AT91C_SSC_PTSR  ((AT91_REG *) 	0xFFFD4124) /* (PDC_SSC) PDC Transfer Status Register*/
#define AT91C_SSC_TNCR  ((AT91_REG *) 	0xFFFD411C) /* (PDC_SSC) Transmit Next Counter Register*/
#define AT91C_SSC_RNCR  ((AT91_REG *) 	0xFFFD4114) /* (PDC_SSC) Receive Next Counter Register*/
#define AT91C_SSC_TCR   ((AT91_REG *) 	0xFFFD410C) /* (PDC_SSC) Transmit Counter Register*/
#define AT91C_SSC_RCR   ((AT91_REG *) 	0xFFFD4104) /* (PDC_SSC) Receive Counter Register*/
/* ========== Register definition for SSC peripheral ========== */
#define AT91C_SSC_RFMR  ((AT91_REG *) 	0xFFFD4014) /* (SSC) Receive Frame Mode Register*/
#define AT91C_SSC_CMR   ((AT91_REG *) 	0xFFFD4004) /* (SSC) Clock Mode Register*/
#define AT91C_SSC_IDR   ((AT91_REG *) 	0xFFFD4048) /* (SSC) Interrupt Disable Register*/
#define AT91C_SSC_SR    ((AT91_REG *) 	0xFFFD4040) /* (SSC) Status Register*/
#define AT91C_SSC_RSHR  ((AT91_REG *) 	0xFFFD4030) /* (SSC) Receive Sync Holding Register*/
#define AT91C_SSC_RHR   ((AT91_REG *) 	0xFFFD4020) /* (SSC) Receive Holding Register*/
#define AT91C_SSC_TCMR  ((AT91_REG *) 	0xFFFD4018) /* (SSC) Transmit Clock Mode Register*/
#define AT91C_SSC_RCMR  ((AT91_REG *) 	0xFFFD4010) /* (SSC) Receive Clock ModeRegister*/
#define AT91C_SSC_CR    ((AT91_REG *) 	0xFFFD4000) /* (SSC) Control Register*/
#define AT91C_SSC_IMR   ((AT91_REG *) 	0xFFFD404C) /* (SSC) Interrupt Mask Register*/
#define AT91C_SSC_IER   ((AT91_REG *) 	0xFFFD4044) /* (SSC) Interrupt Enable Register*/
#define AT91C_SSC_TSHR  ((AT91_REG *) 	0xFFFD4034) /* (SSC) Transmit Sync Holding Register*/
#define AT91C_SSC_THR   ((AT91_REG *) 	0xFFFD4024) /* (SSC) Transmit Holding Register*/
#define AT91C_SSC_TFMR  ((AT91_REG *) 	0xFFFD401C) /* (SSC) Transmit Frame Mode Register*/
/* ========== Register definition for TWI peripheral ========== */
#define AT91C_TWI_RHR   ((AT91_REG *) 	0xFFFB8030) /* (TWI) Receive Holding Register*/
#define AT91C_TWI_IDR   ((AT91_REG *) 	0xFFFB8028) /* (TWI) Interrupt Disable Register*/
#define AT91C_TWI_SR    ((AT91_REG *) 	0xFFFB8020) /* (TWI) Status Register*/
#define AT91C_TWI_CWGR  ((AT91_REG *) 	0xFFFB8010) /* (TWI) Clock Waveform Generator Register*/
#define AT91C_TWI_SMR   ((AT91_REG *) 	0xFFFB8008) /* (TWI) Slave Mode Register*/
#define AT91C_TWI_CR    ((AT91_REG *) 	0xFFFB8000) /* (TWI) Control Register*/
#define AT91C_TWI_THR   ((AT91_REG *) 	0xFFFB8034) /* (TWI) Transmit Holding Register*/
#define AT91C_TWI_IMR   ((AT91_REG *) 	0xFFFB802C) /* (TWI) Interrupt Mask Register*/
#define AT91C_TWI_IER   ((AT91_REG *) 	0xFFFB8024) /* (TWI) Interrupt Enable Register*/
#define AT91C_TWI_IADR  ((AT91_REG *) 	0xFFFB800C) /* (TWI) Internal Address Register*/
#define AT91C_TWI_MMR   ((AT91_REG *) 	0xFFFB8004) /* (TWI) Master Mode Register*/
/* ========== Register definition for PWMC_CH3 peripheral ========== */
#define AT91C_CH3_CUPDR ((AT91_REG *) 	0xFFFCC270) /* (PWMC_CH3) Channel Update Register*/
#define AT91C_CH3_CPRDR ((AT91_REG *) 	0xFFFCC268) /* (PWMC_CH3) Channel Period Register*/
#define AT91C_CH3_CMR   ((AT91_REG *) 	0xFFFCC260) /* (PWMC_CH3) Channel Mode Register*/
#define AT91C_CH3_Reserved ((AT91_REG *) 	0xFFFCC274) /* (PWMC_CH3) Reserved*/
#define AT91C_CH3_CCNTR ((AT91_REG *) 	0xFFFCC26C) /* (PWMC_CH3) Channel Counter Register*/
#define AT91C_CH3_CDTYR ((AT91_REG *) 	0xFFFCC264) /* (PWMC_CH3) Channel Duty Cycle Register*/
/* ========== Register definition for PWMC_CH2 peripheral ========== */
#define AT91C_CH2_CUPDR ((AT91_REG *) 	0xFFFCC250) /* (PWMC_CH2) Channel Update Register*/
#define AT91C_CH2_CPRDR ((AT91_REG *) 	0xFFFCC248) /* (PWMC_CH2) Channel Period Register*/
#define AT91C_CH2_CMR   ((AT91_REG *) 	0xFFFCC240) /* (PWMC_CH2) Channel Mode Register*/
#define AT91C_CH2_Reserved ((AT91_REG *) 	0xFFFCC254) /* (PWMC_CH2) Reserved*/
#define AT91C_CH2_CCNTR ((AT91_REG *) 	0xFFFCC24C) /* (PWMC_CH2) Channel Counter Register*/
#define AT91C_CH2_CDTYR ((AT91_REG *) 	0xFFFCC244) /* (PWMC_CH2) Channel Duty Cycle Register*/
/* ========== Register definition for PWMC_CH1 peripheral ========== */
#define AT91C_CH1_CUPDR ((AT91_REG *) 	0xFFFCC230) /* (PWMC_CH1) Channel Update Register*/
#define AT91C_CH1_CPRDR ((AT91_REG *) 	0xFFFCC228) /* (PWMC_CH1) Channel Period Register*/
#define AT91C_CH1_CMR   ((AT91_REG *) 	0xFFFCC220) /* (PWMC_CH1) Channel Mode Register*/
#define AT91C_CH1_Reserved ((AT91_REG *) 	0xFFFCC234) /* (PWMC_CH1) Reserved*/
#define AT91C_CH1_CCNTR ((AT91_REG *) 	0xFFFCC22C) /* (PWMC_CH1) Channel Counter Register*/
#define AT91C_CH1_CDTYR ((AT91_REG *) 	0xFFFCC224) /* (PWMC_CH1) Channel Duty Cycle Register*/
/* ========== Register definition for PWMC_CH0 peripheral ========== */
#define AT91C_CH0_CUPDR ((AT91_REG *) 	0xFFFCC210) /* (PWMC_CH0) Channel Update Register*/
#define AT91C_CH0_CPRDR ((AT91_REG *) 	0xFFFCC208) /* (PWMC_CH0) Channel Period Register*/
#define AT91C_CH0_CMR   ((AT91_REG *) 	0xFFFCC200) /* (PWMC_CH0) Channel Mode Register*/
#define AT91C_CH0_Reserved ((AT91_REG *) 	0xFFFCC214) /* (PWMC_CH0) Reserved*/
#define AT91C_CH0_CCNTR ((AT91_REG *) 	0xFFFCC20C) /* (PWMC_CH0) Channel Counter Register*/
#define AT91C_CH0_CDTYR ((AT91_REG *) 	0xFFFCC204) /* (PWMC_CH0) Channel Duty Cycle Register*/
/* ========== Register definition for PWMC peripheral ========== */
#define AT91C_PWMC_VR   ((AT91_REG *) 	0xFFFCC0FC) /* (PWMC) PWMC Version Register*/
#define AT91C_PWMC_ISR  ((AT91_REG *) 	0xFFFCC01C) /* (PWMC) PWMC Interrupt Status Register*/
#define AT91C_PWMC_IDR  ((AT91_REG *) 	0xFFFCC014) /* (PWMC) PWMC Interrupt Disable Register*/
#define AT91C_PWMC_SR   ((AT91_REG *) 	0xFFFCC00C) /* (PWMC) PWMC Status Register*/
#define AT91C_PWMC_ENA  ((AT91_REG *) 	0xFFFCC004) /* (PWMC) PWMC Enable Register*/
#define AT91C_PWMC_IMR  ((AT91_REG *) 	0xFFFCC018) /* (PWMC) PWMC Interrupt Mask Register*/
#define AT91C_PWMC_MR   ((AT91_REG *) 	0xFFFCC000) /* (PWMC) PWMC Mode Register*/
#define AT91C_PWMC_DIS  ((AT91_REG *) 	0xFFFCC008) /* (PWMC) PWMC Disable Register*/
#define AT91C_PWMC_IER  ((AT91_REG *) 	0xFFFCC010) /* (PWMC) PWMC Interrupt Enable Register*/
/* ========== Register definition for UDP peripheral ========== */
#define AT91C_UDP_TXVC  ((AT91_REG *) 	0xFFFB0074) /* (UDP) Transceiver Control Register*/
#define AT91C_UDP_ISR   ((AT91_REG *) 	0xFFFB001C) /* (UDP) Interrupt Status Register*/
#define AT91C_UDP_IDR   ((AT91_REG *) 	0xFFFB0014) /* (UDP) Interrupt Disable Register*/
#define AT91C_UDP_CSR   ((AT91_REG *) 	0xFFFB0030) /* (UDP) Endpoint Control and Status Register*/
#define AT91C_UDP_RSTEP ((AT91_REG *) 	0xFFFB0028) /* (UDP) Reset Endpoint Register*/
#define AT91C_UDP_ICR   ((AT91_REG *) 	0xFFFB0020) /* (UDP) Interrupt Clear Register*/
#define AT91C_UDP_GLBSTATE ((AT91_REG *) 	0xFFFB0004) /* (UDP) Global State Register*/
#define AT91C_UDP_NUM   ((AT91_REG *) 	0xFFFB0000) /* (UDP) Frame Number Register*/
#define AT91C_UDP_FADDR ((AT91_REG *) 	0xFFFB0008) /* (UDP) Function Address Register*/
#define AT91C_UDP_IER   ((AT91_REG *) 	0xFFFB0010) /* (UDP) Interrupt Enable Register*/
#define AT91C_UDP_IMR   ((AT91_REG *) 	0xFFFB0018) /* (UDP) Interrupt Mask Register*/
#define AT91C_UDP_FDR   ((AT91_REG *) 	0xFFFB0050) /* (UDP) Endpoint FIFO Data Register*/
/* ========== Register definition for TC0 peripheral ========== */
#define AT91C_TC0_IMR   ((AT91_REG *) 	0xFFFA002C) /* (TC0) Interrupt Mask Register*/
#define AT91C_TC0_IER   ((AT91_REG *) 	0xFFFA0024) /* (TC0) Interrupt Enable Register*/
#define AT91C_TC0_RC    ((AT91_REG *) 	0xFFFA001C) /* (TC0) Register C*/
#define AT91C_TC0_RA    ((AT91_REG *) 	0xFFFA0014) /* (TC0) Register A*/
#define AT91C_TC0_CMR   ((AT91_REG *) 	0xFFFA0004) /* (TC0) Channel Mode Register (Capture Mode / Waveform Mode)*/
#define AT91C_TC0_IDR   ((AT91_REG *) 	0xFFFA0028) /* (TC0) Interrupt Disable Register*/
#define AT91C_TC0_SR    ((AT91_REG *) 	0xFFFA0020) /* (TC0) Status Register*/
#define AT91C_TC0_RB    ((AT91_REG *) 	0xFFFA0018) /* (TC0) Register B*/
#define AT91C_TC0_CV    ((AT91_REG *) 	0xFFFA0010) /* (TC0) Counter Value*/
#define AT91C_TC0_CCR   ((AT91_REG *) 	0xFFFA0000) /* (TC0) Channel Control Register*/
/* ========== Register definition for TC1 peripheral ========== */
#define AT91C_TC1_IMR   ((AT91_REG *) 	0xFFFA006C) /* (TC1) Interrupt Mask Register*/
#define AT91C_TC1_IER   ((AT91_REG *) 	0xFFFA0064) /* (TC1) Interrupt Enable Register*/
#define AT91C_TC1_RC    ((AT91_REG *) 	0xFFFA005C) /* (TC1) Register C*/
#define AT91C_TC1_RA    ((AT91_REG *) 	0xFFFA0054) /* (TC1) Register A*/
#define AT91C_TC1_CMR   ((AT91_REG *) 	0xFFFA0044) /* (TC1) Channel Mode Register (Capture Mode / Waveform Mode)*/
#define AT91C_TC1_IDR   ((AT91_REG *) 	0xFFFA0068) /* (TC1) Interrupt Disable Register*/
#define AT91C_TC1_SR    ((AT91_REG *) 	0xFFFA0060) /* (TC1) Status Register*/
#define AT91C_TC1_RB    ((AT91_REG *) 	0xFFFA0058) /* (TC1) Register B*/
#define AT91C_TC1_CV    ((AT91_REG *) 	0xFFFA0050) /* (TC1) Counter Value*/
#define AT91C_TC1_CCR   ((AT91_REG *) 	0xFFFA0040) /* (TC1) Channel Control Register*/
/* ========== Register definition for TC2 peripheral ========== */
#define AT91C_TC2_IMR   ((AT91_REG *) 	0xFFFA00AC) /* (TC2) Interrupt Mask Register*/
#define AT91C_TC2_IER   ((AT91_REG *) 	0xFFFA00A4) /* (TC2) Interrupt Enable Register*/
#define AT91C_TC2_RC    ((AT91_REG *) 	0xFFFA009C) /* (TC2) Register C*/
#define AT91C_TC2_RA    ((AT91_REG *) 	0xFFFA0094) /* (TC2) Register A*/
#define AT91C_TC2_CMR   ((AT91_REG *) 	0xFFFA0084) /* (TC2) Channel Mode Register (Capture Mode / Waveform Mode)*/
#define AT91C_TC2_IDR   ((AT91_REG *) 	0xFFFA00A8) /* (TC2) Interrupt Disable Register*/
#define AT91C_TC2_SR    ((AT91_REG *) 	0xFFFA00A0) /* (TC2) Status Register*/
#define AT91C_TC2_RB    ((AT91_REG *) 	0xFFFA0098) /* (TC2) Register B*/
#define AT91C_TC2_CV    ((AT91_REG *) 	0xFFFA0090) /* (TC2) Counter Value*/
#define AT91C_TC2_CCR   ((AT91_REG *) 	0xFFFA0080) /* (TC2) Channel Control Register*/
/* ========== Register definition for TCB peripheral ========== */
#define AT91C_TCB_BMR   ((AT91_REG *) 	0xFFFA00C4) /* (TCB) TC Block Mode Register*/
#define AT91C_TCB_BCR   ((AT91_REG *) 	0xFFFA00C0) /* (TCB) TC Block Control Register*/
/* ========== Register definition for PDC_ADC peripheral ========== */
#define AT91C_ADC_PTCR  ((AT91_REG *) 	0xFFFD8120) /* (PDC_ADC) PDC Transfer Control Register*/
#define AT91C_ADC_TNPR  ((AT91_REG *) 	0xFFFD8118) /* (PDC_ADC) Transmit Next Pointer Register*/
#define AT91C_ADC_RNPR  ((AT91_REG *) 	0xFFFD8110) /* (PDC_ADC) Receive Next Pointer Register*/
#define AT91C_ADC_TPR   ((AT91_REG *) 	0xFFFD8108) /* (PDC_ADC) Transmit Pointer Register*/
#define AT91C_ADC_RPR   ((AT91_REG *) 	0xFFFD8100) /* (PDC_ADC) Receive Pointer Register*/
#define AT91C_ADC_PTSR  ((AT91_REG *) 	0xFFFD8124) /* (PDC_ADC) PDC Transfer Status Register*/
#define AT91C_ADC_TNCR  ((AT91_REG *) 	0xFFFD811C) /* (PDC_ADC) Transmit Next Counter Register*/
#define AT91C_ADC_RNCR  ((AT91_REG *) 	0xFFFD8114) /* (PDC_ADC) Receive Next Counter Register*/
#define AT91C_ADC_TCR   ((AT91_REG *) 	0xFFFD810C) /* (PDC_ADC) Transmit Counter Register*/
#define AT91C_ADC_RCR   ((AT91_REG *) 	0xFFFD8104) /* (PDC_ADC) Receive Counter Register*/
/* ========== Register definition for ADC peripheral ========== */
#define AT91C_ADC_IMR   ((AT91_REG *) 	0xFFFD802C) /* (ADC) ADC Interrupt Mask Register*/
#define AT91C_ADC_CDR4  ((AT91_REG *) 	0xFFFD8040) /* (ADC) ADC Channel Data Register 4*/
#define AT91C_ADC_CDR2  ((AT91_REG *) 	0xFFFD8038) /* (ADC) ADC Channel Data Register 2*/
#define AT91C_ADC_CDR0  ((AT91_REG *) 	0xFFFD8030) /* (ADC) ADC Channel Data Register 0*/
#define AT91C_ADC_CDR7  ((AT91_REG *) 	0xFFFD804C) /* (ADC) ADC Channel Data Register 7*/
#define AT91C_ADC_CDR1  ((AT91_REG *) 	0xFFFD8034) /* (ADC) ADC Channel Data Register 1*/
#define AT91C_ADC_CDR3  ((AT91_REG *) 	0xFFFD803C) /* (ADC) ADC Channel Data Register 3*/
#define AT91C_ADC_CDR5  ((AT91_REG *) 	0xFFFD8044) /* (ADC) ADC Channel Data Register 5*/
#define AT91C_ADC_MR    ((AT91_REG *) 	0xFFFD8004) /* (ADC) ADC Mode Register*/
#define AT91C_ADC_CDR6  ((AT91_REG *) 	0xFFFD8048) /* (ADC) ADC Channel Data Register 6*/
#define AT91C_ADC_CR    ((AT91_REG *) 	0xFFFD8000) /* (ADC) ADC Control Register*/
#define AT91C_ADC_CHER  ((AT91_REG *) 	0xFFFD8010) /* (ADC) ADC Channel Enable Register*/
#define AT91C_ADC_CHSR  ((AT91_REG *) 	0xFFFD8018) /* (ADC) ADC Channel Status Register*/
#define AT91C_ADC_IER   ((AT91_REG *) 	0xFFFD8024) /* (ADC) ADC Interrupt Enable Register*/
#define AT91C_ADC_SR    ((AT91_REG *) 	0xFFFD801C) /* (ADC) ADC Status Register*/
#define AT91C_ADC_CHDR  ((AT91_REG *) 	0xFFFD8014) /* (ADC) ADC Channel Disable Register*/
#define AT91C_ADC_IDR   ((AT91_REG *) 	0xFFFD8028) /* (ADC) ADC Interrupt Disable Register*/
#define AT91C_ADC_LCDR  ((AT91_REG *) 	0xFFFD8020) /* (ADC) ADC Last Converted Data Register*/
/* ========== Register definition for EBI peripheral ========== */
#define AT91C_EBI_CSA   ((AT91_REG *) 	0xFFFFFF80) /* (EBI) EBI Chip Select Assignment Register*/
/* ========== Register definition for SMC peripheral ========== */
#define AT91C_SMC_CSR   ((AT91_REG *) 	0xFFFFFF90) /* (SMC) SMC2 Chip Select Register*/
/* ========== Register definition for SDRC peripheral ========== */
#define AT91C_SDRC_VER  ((AT91_REG *) 	0xFFFFFFD4) /* (SDRC) SDRAM Controller Version Register*/
#define AT91C_SDRC_IMR  ((AT91_REG *) 	0xFFFFFFCC) /* (SDRC) SDRAM Controller Interrupt Mask Register*/
#define AT91C_SDRC_IER  ((AT91_REG *) 	0xFFFFFFC4) /* (SDRC) SDRAM Controller Interrupt Enable Register*/
#define AT91C_SDRC_SRR  ((AT91_REG *) 	0xFFFFFFBC) /* (SDRC) SDRAM Controller Self Refresh Register*/
#define AT91C_SDRC_TR   ((AT91_REG *) 	0xFFFFFFB4) /* (SDRC) SDRAM Controller Refresh Timer Register*/
#define AT91C_SDRC_ISR  ((AT91_REG *) 	0xFFFFFFD0) /* (SDRC) SDRAM Controller Interrupt Mask Register*/
#define AT91C_SDRC_IDR  ((AT91_REG *) 	0xFFFFFFC8) /* (SDRC) SDRAM Controller Interrupt Disable Register*/
#define AT91C_SDRC_LPR  ((AT91_REG *) 	0xFFFFFFC0) /* (SDRC) SDRAM Controller Low Power Register*/
#define AT91C_SDRC_CR   ((AT91_REG *) 	0xFFFFFFB8) /* (SDRC) SDRAM Controller Configuration Register*/
#define AT91C_SDRC_MR   ((AT91_REG *) 	0xFFFFFFB0) /* (SDRC) SDRAM Controller Mode Register*/
/* ========== Register definition for HECC peripheral ========== */
#define AT91C_HECC_NPR  ((AT91_REG *) 	0xFFFFFFEC) /* (HECC)  ECC Parity N register*/
#define AT91C_HECC_SR   ((AT91_REG *) 	0xFFFFFFE4) /* (HECC)  ECC Status register*/
#define AT91C_HECC_CR   ((AT91_REG *) 	0xFFFFFFDC) /* (HECC)  ECC reset register*/
#define AT91C_HECC_VR   ((AT91_REG *) 	0xFFFFFFF0) /* (HECC)  ECC Version register*/
#define AT91C_HECC_PR   ((AT91_REG *) 	0xFFFFFFE8) /* (HECC)  ECC Parity register*/
#define AT91C_HECC_MR   ((AT91_REG *) 	0xFFFFFFE0) /* (HECC)  ECC Page size register*/

