una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91sam7se512.h
/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR Periodic Interval Timer Controller Interface*/
/* - ******************************************************************************/
/* - -------- PITC_PIMR : (PITC Offset: 0x0) Periodic Interval Mode Register -------- */
AT91C_PITC_PIV            EQU (0xFFFFF <<  0) ;- (PITC) Periodic Interval Value
AT91C_PITC_PITEN          EQU (0x1 << 24) ;- (PITC) Periodic Interval Timer Enabled
AT91C_PITC_PITIEN         EQU (0x1 << 25) ;- (PITC) Periodic Interval Timer Interrupt Enable
/* - -------- PITC_PISR : (PITC Offset: 0x4) Periodic Interval Status Register -------- */
AT91C_PITC_PITS           EQU (0x1 <<  0) ;- (PITC) Periodic Interval Timer Status
/* - -------- PITC_PIVR : (PITC Offset: 0x8) Periodic Interval Value Register -------- */
AT91C_PITC_CPIV           EQU (0xFFFFF <<  0) ;- (PITC) Current Periodic Interval Value
AT91C_PITC_PICNT          EQU (0xFFF << 20) ;- (PITC) Periodic Interval Counter
/* - -------- PITC_PIIR : (PITC Offset: 0xc) Periodic Interval Image Register -------- */

/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR Watchdog Timer Controller Interface*/
/* - ******************************************************************************/
/* - -------- WDTC_WDCR : (WDTC Offset: 0x0) Periodic Interval Image Register -------- */
AT91C_WDTC_WDRSTT         EQU (0x1 <<  0) ;- (WDTC) Watchdog Restart
AT91C_WDTC_KEY            EQU (0xFF << 24) ;- (WDTC) Watchdog KEY Password
/* - -------- WDTC_WDMR : (WDTC Offset: 0x4) Watchdog Mode Register -------- */
AT91C_WDTC_WDV            EQU (0xFFF <<  0) ;- (WDTC) Watchdog Timer Restart
AT91C_WDTC_WDFIEN         EQU (0x1 << 12) ;- (WDTC) Watchdog Fault Interrupt Enable
AT91C_WDTC_WDRSTEN        EQU (0x1 << 13) ;- (WDTC) Watchdog Reset Enable
AT91C_WDTC_WDRPROC        EQU (0x1 << 14) ;- (WDTC) Watchdog Timer Restart
AT91C_WDTC_WDDIS          EQU (0x1 << 15) ;- (WDTC) Watchdog Disable
AT91C_WDTC_WDD            EQU (0xFFF << 16) ;- (WDTC) Watchdog Delta Value
AT91C_WDTC_WDDBGHLT       EQU (0x1 << 28) ;- (WDTC) Watchdog Debug Halt
AT91C_WDTC_WDIDLEHLT      EQU (0x1 << 29) ;- (WDTC) Watchdog Idle Halt
/* - -------- WDTC_WDSR : (WDTC Offset: 0x8) Watchdog Status Register -------- */
AT91C_WDTC_WDUNF          EQU (0x1 <<  0) ;- (WDTC) Watchdog Underflow
AT91C_WDTC_WDERR          EQU (0x1 <<  1) ;- (WDTC) Watchdog Error

/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR Voltage Regulator Mode Controller Interface*/
/* - ******************************************************************************/
/* - -------- VREG_MR : (VREG Offset: 0x0) Voltage Regulator Mode Register -------- */
AT91C_VREG_PSTDBY         EQU (0x1 <<  0) ;- (VREG) Voltage Regulator Power Standby Mode

/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR Memory Controller Interface*/
/* - ******************************************************************************/
/* - -------- MC_RCR : (MC Offset: 0x0) MC Remap Control Register -------- */
AT91C_MC_RCB              EQU (0x1 <<  0) ;- (MC) Remap Command Bit
/* - -------- MC_ASR : (MC Offset: 0x4) MC Abort Status Register -------- */
AT91C_MC_UNDADD           EQU (0x1 <<  0) ;- (MC) Undefined Addess Abort Status
AT91C_MC_MISADD           EQU (0x1 <<  1) ;- (MC) Misaligned Addess Abort Status
AT91C_MC_MPU              EQU (0x1 <<  2) ;- (MC) Memory protection Unit Abort Status
AT91C_MC_ABTSZ            EQU (0x3 <<  8) ;- (MC) Abort Size Status
AT91C_MC_ABTSZ_BYTE       EQU (0x0 <<  8) ;- (MC) Byte
AT91C_MC_ABTSZ_HWORD      EQU (0x1 <<  8) ;- (MC) Half-word
AT91C_MC_ABTSZ_WORD       EQU (0x2 <<  8) ;- (MC) Word
AT91C_MC_ABTTYP           EQU (0x3 << 10) ;- (MC) Abort Type Status
AT91C_MC_ABTTYP_DATAR     EQU (0x0 << 10) ;- (MC) Data Read
AT91C_MC_ABTTYP_DATAW     EQU (0x1 << 10) ;- (MC) Data Write
AT91C_MC_ABTTYP_FETCH     EQU (0x2 << 10) ;- (MC) Code Fetch
AT91C_MC_MST0             EQU (0x1 << 16) ;- (MC) Master 0 Abort Source
AT91C_MC_MST1             EQU (0x1 << 17) ;- (MC) Master 1 Abort Source
AT91C_MC_SVMST0           EQU (0x1 << 24) ;- (MC) Saved Master 0 Abort Source
AT91C_MC_SVMST1           EQU (0x1 << 25) ;- (MC) Saved Master 1 Abort Source
/* - -------- MC_PUIA : (MC Offset: 0x10) MC Protection Unit Area -------- */
AT91C_MC_PROT             EQU (0x3 <<  0) ;- (MC) Protection
AT91C_MC_PROT_PNAUNA      EQU (0x0) ;- (MC) Privilege: No Access, User: No Access
AT91C_MC_PROT_PRWUNA      EQU (0x1) ;- (MC) Privilege: Read/Write, User: No Access
AT91C_MC_PROT_PRWURO      EQU (0x2) ;- (MC) Privilege: Read/Write, User: Read Only
AT91C_MC_PROT_PRWURW      EQU (0x3) ;- (MC) Privilege: Read/Write, User: Read/Write
AT91C_MC_SIZE             EQU (0xF <<  4) ;- (MC) Internal Area Size
AT91C_MC_SIZE_1KB         EQU (0x0 <<  4) ;- (MC) Area size 1KByte
AT91C_MC_SIZE_2KB         EQU (0x1 <<  4) ;- (MC) Area size 2KByte
AT91C_MC_SIZE_4KB         EQU (0x2 <<  4) ;- (MC) Area size 4KByte
AT91C_MC_SIZE_8KB         EQU (0x3 <<  4) ;- (MC) Area size 8KByte
AT91C_MC_SIZE_16KB        EQU (0x4 <<  4) ;- (MC) Area size 16KByte
AT91C_MC_SIZE_32KB        EQU (0x5 <<  4) ;- (MC) Area size 32KByte
AT91C_MC_SIZE_64KB        EQU (0x6 <<  4) ;- (MC) Area size 64KByte
AT91C_MC_SIZE_128KB       EQU (0x7 <<  4) ;- (MC) Area size 128KByte
AT91C_MC_SIZE_256KB       EQU (0x8 <<  4) ;- (MC) Area size 256KByte
AT91C_MC_SIZE_512KB       EQU (0x9 <<  4) ;- (MC) Area size 512KByte
AT91C_MC_SIZE_1MB         EQU (0xA <<  4) ;- (MC) Area size 1MByte
AT91C_MC_SIZE_2MB         EQU (0xB <<  4) ;- (MC) Area size 2MByte
AT91C_MC_SIZE_4MB         EQU (0xC <<  4) ;- (MC) Area size 4MByte
AT91C_MC_SIZE_8MB         EQU (0xD <<  4) ;- (MC) Area size 8MByte
AT91C_MC_SIZE_16MB        EQU (0xE <<  4) ;- (MC) Area size 16MByte
AT91C_MC_SIZE_64MB        EQU (0xF <<  4) ;- (MC) Area size 64MByte
AT91C_MC_BA               EQU (0x3FFFF << 10) ;- (MC) Internal Area Base Address
/* - -------- MC_PUP : (MC Offset: 0x50) MC Protection Unit Peripheral -------- */
/* - -------- MC_PUER : (MC Offset: 0x54) MC Protection Unit Area -------- */
AT91C_MC_PUEB             EQU (0x1 <<  0) ;- (MC) Protection Unit enable Bit

